import os, platform

# Colors
P = '\033[95m' # Pink
C = '\033[96m' # Cyan
G = '\033[92m' # Green
R = '\033[91m' # Red
W = '\033[0m'  # White
Y = '\033[93m' # Yellow

def clear():
    os.system('cls' if platform.system() == 'Windows' else 'clear')

def banner():
    print(f"""
{P} ██╗██████╗     ██╗███╗   ██╗████████╗███████╗██╗     
{P} ██║██╔══██╗    ██║████╗  ██║╚══██╔══╝██╔════╝██║     
{P} ██║██████╔╝    ██║██╔██╗ ██║   ██║   █████╗  ██║     
{W} ██║██╔═══╝     ██║██║╚██╗██║   ██║   ██╔══╝  ██║     
{W} ██║██║         ██║██║ ╚████║   ██║   ███████╗███████╗
{W} ╚═╝╚═╝         ╚═╝╚═╝  ╚═══╝   ╚═╝   ╚══════╝╚══════╝
{C}          [ IP TRACKING - OSINT ]
{Y}        Dev : Spy-E & 123tool PRO{W}
    """)
